app/views/posts/mosaic.html.haml


      - @posts.each do |p|
        .comment.user-comment{class: p.image_class}
          .quote-container
---
SELECT "users".* FROM "users" WHERE "users"."id" = 26 ORDER BY id DESC LIMIT 1