app/controllers/posts_controller.rb

SELECT "topics".* FROM "topics" WHERE (uuid = 'z2sztr3pa6cv') ORDER BY id DESC LIMIT 1
SELECT "topics".* FROM "topics" ORDER BY "topics"."id" DESC LIMIT 1
---
  def find_topic
    if !params['uuid'].nil? then
      return Topic.where('uuid = ?', params['uuid']).first
    else
      return Topic.last